app/views/posts/show.html.haml

%h2 Comments
- @post.comments.each do |comment|
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 2